Revit 2027 API
UIView Methods
The UIView type exposes the following members.
Methods
Name | Description
Close |  Closes the view.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetWindowRectangle |  Gets the rectangle containing the coordinates of the view's drawing area.
GetZoomCorners |  Gets the corners of the view's rectangle. The two points that define the corners of the view's rectangle in model coordinates.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Zoom |  Zoom the view.
ZoomAndCenterRectangle |  Zoom and center the view to a specified rectangle.
ZoomSheetSize |  Zoom to the sheet size.
ZoomToFit |  Zoom the view to fit its contents.
Top
See Also
Reference
UIView Class
Autodesk.Revit.UI Namespace